@gregnolle it seems fine with me. What version of your provider? If you use the latest version which still does not work for you, can you share your debug log?

  # google_compute_network_endpoint_group.neg will be created
  + resource "google_compute_network_endpoint_group" "neg" {
      + default_port          = 90
      + id                    = (known after apply)
      + name                  = "issue16093"
      + network               = (known after apply)
      + network_endpoint_type = "NON_GCP_PRIVATE_IP_PORT"
      + project               = "myproject"
      + self_link             = (known after apply)
      + size                  = (known after apply)
      + zone                  = "us-central1-a"
    }